<!DOCTYPE html>
<html>
<head><title>Personalit&#259;&#355;i </title>

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="css\sursa1.css">
<link rel="stylesheet" href="css\sursa2.css">
<link rel="stylesheet" href="css\font-awesome-4.7.0\css\font-awesome.min.css">
<link rel="stylesheet" href="css\font-awesome-4.7.0\css\font-awesome.css">

@-ms-viewport { width: device-width; }
<style type="text/css">
@font-face {
    font-family: "Roman";
    src: url(font/LibreBaskerville-Regular.otf) format("truetype");
}
p.roman { 
    font-family: "Roman", Verdana, Tahoma;
}
* {box-sizing:border-box}
body {font-family: Verdana,sans-serif;}
.mySlides {display:none}



.active {
  background-color: #717171;
}

/* Fading animation */
.fade {
  -webkit-animation-name: fade;
  -webkit-animation-duration: 1.5s;
  animation-name: fade;
  animation-duration: 1.5s;
}

@-webkit-keyframes fade {
  from {opacity: .4} 
  to {opacity: 1}
}

@keyframes fade {
  from {opacity: .4} 
  to {opacity: 1}
}

/* On smaller screens, decrease text size */
@media only screen and (max-width: 300px) {
  .text {font-size: 11px}

</style>
</head>
<body id="myPage">

<!-- Navbar -->
<!-- Navbar -->
<div class="mine-top">
 <ul class="mine-navbar mine-theme-d2 mine-left-align">
  <li class="mine-hide-medium mine-hide-large mine-opennav mine-right">
    <a class="mine-hover-white mine-theme-d2" href="javascript:void(0);" onclick="openNav()"><i class="fa fa-bars"></i></a>
  </li>
  <li><a href="acasa.html" class="mine-teal"><i class="fa fa-home mine-margin-right"></i>Alba Iulia</a></li>
  <li class="mine-hide-small"><a href="acasa.html#despre" class="mine-hover-white">Despre cetate</a></li>
  <li class="mine-hide-small mine-dropdown-hover">
    <a href="acasa.html#evolutia" title="Timp">Evolu&#355;ie &#238;n timp <i class="fa fa-caret-down"></i></a>     
    <div class="mine-dropdown-content mine-white mine-card-4">
      <a href="acasa.html#evolutia">Castrul roman</a>
      <a href="acasa.html#evolutia">Cetatea medieval&#259;</a>
      <a href="acasa.html#evolutia">Cetatea de tip vauban </a>
      <a href="acasa.html#evolutia">Cetatea &#238;n prezent </a>
    </div>
  </li>
  <li class="mine-hide-small"><a href="acasa.html#obiective" class="mine-hover-white">Obiective turistice</a></li>
  <li class="mine-hide-small mine-dropdown-hover">
    <a href="acasa.html#personalitati" title="Personalitati">Personalit&#259;&#355;i &#351;i evenimente <i class="fa fa-caret-down"></i></a>     
    <div class="mine-dropdown-content mine-white mine-card-4">
      <a href="personalitati.html">Personalit&#259;&#355;i</a>
      <a href="evenimente.html">Evenimente</a>
      
    </div>
  </li>
  
  <li class="mine-hide-small mine-right"><a href="#inceput" class="mine-hover-teal" title="Search"><i class="fa fa-chevron-circle-up"></i></a></li>
 </ul>

  <!-- Navbar on small screens -->
  <div id="navDemo" class="mine-hide mine-hide-large mine-hide-medium">
    <ul class="mine-navbar mine-left-align mine-theme">
      <li><a href="acasa.html#despre">Despre cetate</a></li>
      <li class="mine-dropdown-hover">
      <a href="acasa.html#evolutia" title="Notifications">Evolu&#355;ie &#238;n timp</a>     
      
      </li>
      <li><a href="acasa.html#obiective">Obiective turistice</a></li>
      <li class="mine-dropdown-hover">
      <a href="javascript:void(0);" title="Notifications">Personalit&#259;&#355;i &#351;i evenimente<i class="fa fa-caret-down"></i></a>     
      <div class="mine-dropdown-content mine-light-grey mine-card-4">
      <a href="personalitati.html">Personalit&#259;&#355;i</a>
      <a href="evenimente.html">Evenimente</a>
     
      </div>
      </li>
      
      
    </ul>
  </div>
</div>

		<!-- Imagine personalitati realizat de (c)Suciu Alin-->



   <a name="inceput"></a>
	
  <img src="img/MihaiViteazul.jpg" style="width:100%;min-height:250px;max-height:1000px;">



<br>




<!-- Despre porti -->
<a name="despre"></a>
<div class="mine-container mine-padding-64 mine-center" id="team">

<h1 style="font:105px Times New Roman;">Personalit&#259;&#355;i istorice</h1>
<p style="font:35px Times New Roman;">

 </p>


</div>



		


  
 

<div class="mine-container mine-padding-64 mine-theme-l1" >

<div class="mine-twothird" ><br>



<h2 align=center>1.Iancu de Hunedoara </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
Ioan Huniade a fost un mare aristocrat al regatului Ungariei, care &#238;&#351;i avea domeniul feudal la Hunedoara. A devenit ulterior ban al Severinului, comite de Timi&#351;oara, voievod al Transilvaniei &#351;i regent al Ungariei. Era unul dintre cei mai boga&#355;i nobili ai Europei timpului s&#259;u.
<br> 
	Marea fapt&#259; de arme a lui Iancu de Hunedoara este legat&#259; de asediul Belgradului. Asediul Belgradului de c&#259;tre turci a &#238;nceput la 4 iulie 1456, &#351;i a fost deosebit de puternic. &#238;ns&#259;, flota cruciat&#259; a c&#226;&#351;tigat b&#259;t&#259;lia pe ap&#259; distrug&#226;nd, &#238;n 14 iulie, flota turceasc&#259;, ce &#238;mpiedica aprovizionarea ora&#351;ului. Lupta decisiv&#259; s-a dat &#238;ntre 21-23 iulie. Atacul musulman a fost respins &#238;n 21 iulie, iar &#238;n 23 iulie cre&#351;tinii atacau tab&#259;ra turcilor. Concep&#355;ia strategic&#259; modern&#259; a lui Iancu l-a ajutat s&#259;-l &#238;nfr&#226;ng&#259; pe sultan &#238;n ciuda raportului de for&#355;e defavorabil cre&#351;tinilor &#351;i s&#259; ob&#355;in&#259; cea mai mare victorie de p&#226;n&#259; atunci a cre&#351;tin&#259;t&#259;&#355;ii &#238;mpotriva turcilor.
<br>
Iancu de Hunedoara a murit &#238;n 11 august 1456, de cium&#259;, &#238;n tab&#259;ra de la Zemun. S-a instaurat, dup&#259; victoria cre&#351;tinilor de la Belgrad, o perioad&#259; de 70 de ani de lini&#351;te relativ&#259; la grani&#355;a de sud est a regatului maghiar.
Iancu de Hunedoara este &#238;nmorm&#226;ntat la Alba Iulia, &#238;n Catedrala Sf. Mihail. Pe piatra sa funerar&#259; st&#259; &#238;nscris "s-a stins lumina lumii". P&#226;n&#259; &#351;i sultanul Mahomed al II-lea (Mehmed II) i-a adus omagiul s&#259;u: "Cu toate c&#259; a fost inamicul meu, la moartea lui, m-am &#238;ntristat, pentru c&#259; lumea nu a mai cunoscut, niciodat&#259;, un asemenea om."


</p>
</div>

<div class="mine-third" ><br>

<a href="img/iancu de hunedoara.jpg" target=blank> <img src="img/iancu de hunedoara.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>  

<div class="mine-container mine-padding-64 " >

<div class="mine-twothird" ><br>



<h2 align=center>2.Mihai Viteazul </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
La 1 noiembrie 1599, Mihai Viteazul intra victorios &#238;n Cetatea Balgradului rostind celebrele cuvinte "Asta-i pohta ce-am pohtit", &#238;mplinind astfel la Alba Iulia visul de unire al rom&#226;nilor din cele trei provincii rom&#226;nesti: Moldova, Ardealul si Tara Rom&#226;neasca. Din pacate, aceasta unire a fost de scurta durata, Mihai Viteazul fiind ucis putin timp mai t&#226;rziu… 
La mai bine de 300 de ani de la Unirea &#238;nfaptuita de Mihai Viteazul, visul rom&#226;nilor de a trai uniti s-a &#238;mplinit prin Marea Adunare Nationala din 1 Decembrie 1918 de la Alba Iulia, c&#226;nd s-a decis unirea Transilvaniei cu Rom&#226;nia. Astfel, s-au pus bazele Statului Unitar Modern Rom&#226;n. Momentul este sarbatorit &#238;n fiecare an pe 1 decembrie, aceasta data devenind Ziua Nationala a Rom&#226;niei. 



</p>
</div>
<div class="mine-third" ><br>

<a href="img/mihai viteazul2.jpg" target=blank> <img src="img/mihai viteazul2.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>  


<div class="mine-container mine-padding-64 mine-theme-l1" >

<div class="mine-twothird" ><br>



<h2 align=center>3.Horea, Clo&#351;ca &#351;i Cri&#351;an</h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
Pentru a-l prinde pe Horea, nobilii au pus pe capul lui un premiu de 300 de galbeni. Pasurile de trecere &#238;n &#355;ara Rom&#226;neasc&#259; &#351;i Moldova erau riguros supravegheate, ca nu cumva capii revolu&#355;iei s&#259; fug&#259; acolo. Guvernul din Viena a intervenit &#351;i la Constantinopol, pentru ca turcii s&#259; nu dea azil r&#259;scula&#355;ilor transilvani.Prin tr&#259;dare, la 27 decembrie 1784, de c&#259;tre p&#259;durarul Anton Melzer din Abrud, Horea &#351;i Clo&#351;ca au fost prin&#351;i &#238;n p&#259;durea Scoru&#351;etului din Mun&#355;ii Gil&#259;ului. &#206;n 30 ianuarie 1785 a c&#259;zut prizonier &#351;i Cri&#351;an, v&#226;ndut de nou&#259; &#355;&#259;rani greco-catolici din C&#259;rpeni&#351;, c&#259;peteniile lor fiind preo&#355;ii greco-catolici din acel sat, tat&#259; &#351;i fiu (Popa Moise/&#259; &#351;i Popa Moise/&#259; cel T&#226;n&#259;r). Aresta&#355;ii au fost depu&#351;i la Alba Iulia.
S-a constituit o comisie de anchet&#259;, condus&#259; de baronul Anton Iankovic, care a cercetat desf&#259;&#351;urarea r&#259;scoalei &#351;i pe cei trei conduc&#259;tori ai acesteia.
<br>
•	Cri&#351;an s-a sp&#226;nzurat &#238;n &#238;nchisoare, iar Horea &#351;i Clo&#351;ca au fost supu&#351;i celei mai grele pedepse prev&#259;zut&#259; de Constitutio Criminalis Theresiana, prin fr&#226;ngerea cu roat&#259;. &#206;n ziua de 28 februarie, orele 9:00, a &#238;nceput procesiunea execu&#355;iei. Horea &#351;i Clo&#351;ca au fost transporta&#355;i &#238;n dou&#259; care separate, av&#226;nd al&#259;turi p&#226;n&#259; &#238;n momentul execu&#355;iei pe preotul Ra&#355;iu din Maierii B&#259;lgradului. Procesiunea era &#238;ncadrat&#259; de un escadron de cavalerie de Toscana &#351;i aproximativ de 300 de pedestra&#351;i &#351;i husari. Pe Dealul Furcilor (ast&#259;zi Dealul lui Horea), &#238;n jurul podiumului amenajat, au fost adu&#351;i cu for&#355;a &#238;ntre 2.500-3.000 de iobagi rom&#226;ni, c&#226;te trei tineri &#351;i trei b&#259;tr&#226;ni, din peste 400 de sate din cele patru comitate apropiate, unde s-au desf&#259;&#351;urat principalele evenimente ale r&#259;scoalei.
<br>
Execu&#355;ia prin tragere pe roat&#259; s-a desf&#259;&#351;urat dup&#259; un ritual dinainte stabilit. Mai &#238;nt&#226;i a fost executat Clo&#351;ca care a primit 20 de lovituri, &#238;n timp ce Horea asista &#238;n picioare. A urmat Horea, c&#259;ruia i-au dat 4 lovituri prin care i-au zdrobit picioarele, apoi c&#259;l&#259;ul, un &#355;igan pe nume Grancea Rakoczi din Alba Iulia, i-a zdrobit pieptul &#351;i dup&#259; alte 8-9 lovituri &#351;i-a dat sufletul. Conform sentin&#355;ei, organele interne au fost &#238;ngropate pe Dealul Furcilor, iar corpurile le-au fost t&#259;iate &#238;n 4 p&#259;r&#355;i &#351;i puse &#238;n &#355;eap&#259; &#238;n cele mai importante localit&#259;&#355;i din comitatele Alba &#351;i Hunedoara pentru intimidarea poporului. Corpul lui Cri&#351;an a fost tratat &#238;n aceea&#351;i manier&#259;.



</p>
</div>
<div class="mine-third" ><br>

<a href="img/horea-closca-si-crisan.jpg" target=blank> <img src="img/horea-closca-si-crisan.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>  

<div class="mine-container mine-padding-64 " >
<div class="mine-twothird" ><br>



<h2 align=center>4.Gheorghe Pop de B&#259;se&#351;ti </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
George Pop de B&#259;se&#351;ti a fost un politician rom&#226;n din Transilvania, &#238;ntre 1881-1902 vicepre&#351;edinte, iar &#238;ntre 1902-1918 pre&#351;edinte al Partidului Na&#355;ional Rom&#226;n din Transilvania. &#206;n perioada 1892-1894 George Pop de B&#259;se&#351;ti a fost unul dintre liderii mi&#351;c&#259;rii memorandiste, care cerea autonomia Transilvaniei &#351;i drepturi suplimentare pentru rom&#226;nii din Transilvania aflat&#259; &#238;n Austro-Ungaria. A fost unul dintre politicienii rom&#226;ni condamna&#355;i la &#238;nchisoare pentru sus&#355;inerea Memorandumului, &#238;n cadrul procesului memorandi&#351;tilor de la Cluj &#238;n 1894. A prezidat Adunarea Na&#355;ional&#259; de la Alba Iulia din 1 decembrie 1918. A murit c&#226;teva luni mai t&#226;rziu, la v&#226;rsta de 84 de ani. Urma&#351;ul s&#259;u la conducerea PNR a fost Iuliu Maniu.



</p>
</div>
<div class="mine-third" ><br>

<a href="img/George_Pop_de_Basesti.jpg" target=blank> <img src="img/George_Pop_de_Basesti.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>   

<div class="mine-container mine-padding-64 mine-theme-l1" >

<div class="mine-twothird" ><br>



<h2 align=center>5.Iuliu Maniu </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
Iuliu Maniu a fost  deputat rom&#226;n de Transilvania &#238;n Dieta de la Budapesta, de mai multe ori prim-ministru al Rom&#226;niei, (noiembrie 1928-iunie 1930; iunie 1930-octombrie 1930; octombrie 1932-ianuarie 1933), pre&#351;edinte al Partidului Na&#355;ional-&#354;&#259;r&#259;nesc (1926-1933, 1937-1947), de&#355;inut politic dup&#259; 1947, decedat &#238;n &#238;nchisoarea Sighet. A fost membru de onoare (din 1919) al Academiei Rom&#226;ne .
<br>
Iuliu Maniu s-a num&#259;rat &#238;ntre organizatorii Marii Adun&#259;ri de la Alba Iulia, din 1 decembrie 1918, unde s-a decis unirea Transilvaniei cu Regatul Rom&#226;niei. &#238;n cuv&#226;ntarea pe care a &#355;inut-o cu ocazia Adun&#259;rii na&#355;ionale de la Alba Iulia, Maniu a spus: "Privim &#238;n &#238;nf&#259;ptuirea unit&#259;&#355;ii noastre na&#355;ionale ca la un triumf al libert&#259;&#355;ii rom&#226;ne&#351;ti". Pe 2 decembrie 1918 a fost ales &#238;n func&#355;ia de ministru-prezident al Consiliului Dirigent al Transilvaniei, func&#355;ie echivalent&#259; cu cea de guvernator, &#238;ndeplinind, totodat&#259;, &#351;i func&#355;ia de ministru de interne.




</p>
</div>
<div class="mine-third" ><br>

<a href="img/Iuliu-Maniu.jpg" target=blank> <img src="img/Iuliu-Maniu.jpg" style="float:right;"   width="80%">
</a>
</div>

</div> 



<div class="mine-container mine-padding-64  " >

<div class="mine-twothird" ><br>

<p style="font:30px Times New Roman;text-align: justify;">


<br>
<h2 align=center>6.Vasile Goldi&#351; </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
Vasile Goldi&#351; a fost un pedagog, om politic, membru de onoare al Academiei Rom&#226;ne La 1 decembrie 1918 Vasile Goldi&#351; a rostit la Marea Adunare Na&#355;ional&#259; de la Alba Iulia un discurs &#238;n care a relevat inevitabilitatea dezmembr&#259;rii monarhiei austro-ungare &#351;i necesitatea unirii Transilvaniei cu Rom&#226;nia. &#238;ncep&#226;nd cu 2 decembrie 1918 a fost ministru al Instruc&#355;iunii Publice &#238;n Consiliul Dirigent de la Sibiu, func&#355;ie pe care a exercitat-o p&#226;n&#259; pe 17 decembrie 1918, c&#226;nd a fost numit ministru f&#259;r&#259; portofoliu &#238;n guvernul central de la Bucure&#351;ti. Mandatul s&#259;u de ministru al Instruc&#355;iunii Publice &#238;n Consiliul Dirigent a fost preluat de Valeriu Brani&#351;te.

</p>

</div>
<div class="mine-third" ><br>
<a href="img/goldis.jpg" target=blank> <img src="img/goldis.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>    


   








<div class="mine-container mine-padding-64 mine-theme-l1" >

<div class="mine-twothird" ><br>



<h2 align=center>7.Miron Cristea</h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
La sf&#226;r&#351;itul primului r&#259;zboi mondial, Cristea a participat, ca episcop al Caransebe&#351;ului, al&#259;turi de episcopul unit Iuliu Hossu, la Marea Adunare Na&#355;ional&#259; de la Alba Iulia din 1 decembrie 1918. &#206;n fa&#355;a Marii Adun&#259;ri de la Alba Iulia, episcopul Iuliu Hossu s-a &#238;mbr&#259;&#355;i&#351;at cu episcopul Miron Cristea, spun&#226;nd urm&#259;toarea fraz&#259; memorabil&#259;:
"Pe cum ne vede&#355;i azi &#238;mbr&#259;&#355;i&#351;a&#355;i fr&#259;&#355;e&#351;te, a&#351;a s&#259; r&#259;m&#226;n&#259; &#238;mbr&#259;&#355;i&#351;a&#355;i pe veci to&#355;i fra&#355;ii rom&#226;ni!"
<br> 




</p>

</div>
<div class="mine-third" ><br>
<a href="img/Miron_Cristea.jpg" target=blank> <img src="img/Miron_Cristea.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>  


<div class="mine-container mine-padding-64 " >

<div class="mine-twothird" ><br>



<h2 align=center>8.Iuliu Hossu </h2>
<br>
<p style="font:30px Times New Roman;text-align: justify;">
Fost episcop greco-catolic de Cluj-Gherla, Iuliu Hossu a fost cel care, in 1948, a dat Decretul de Excomunicare a celor 37 de preo&#355;i greco-catolici care urmau sa stabileasca ruperea credinciosilor greco-catolici romani de Biserica de la Roma, la ordinul lui Stalin. Tot el a ocupat functia de senator de drept in Parlamentul Romaniei Mari si a fost unul din conducatorii Adunarii de la Alba Iulia din 1 decembrie 1918. In cinstea implinirii a 130 de ani de la nasterea sa, Banca Nationala a Romaniei a pus in circulatie, in luna martie a acestui an, o moneda de argint, cu valorea nominala de 10 lei.


</p>

</div>
<div class="mine-third" ><br>
<a href="img/iuliu_hossu.jpg" target=blank> <img src="img/iuliu_hossu.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>  



<div class="mine-container mine-padding-64 mine-theme-l1" >

<div class="mine-twothird" ><br>




<h2 align=center>9.Regele Ferdinand &#351;i Regina Maria</h2>
<br>

<p style="font:30px Times New Roman;text-align: justify;">
Duminic&#259;, 15 octombrie 1922, o zi ploioas&#259; de toamn&#259;, o zi de care o lumea &#238;ntreag&#259; &#238;&#351;i aminte&#351;te &#351;i care a umplut paginile de istorie a Rom&#226;niei, dar, cel mai important, ziua &#238;n care Regele Ferdinand &#351;i Regina Maria au fost &#238;ncorona&#355;i ca regi ai Rom&#226;niei Mari. 
Simbolurile care au fost sfin&#355;ite &#238;n diminea&#355;a &#238;ncoron&#259;rii au fost coroana de o&#355;el a unchiului lui Ferdinand, Carol I, cu care a fost &#238;ncoronat &#238;n 1881 ca prim rege al Rom&#226;niei (Coroana a fost f&#259;cut&#259; din o&#355;elul de la un tun turcesc, capturat &#238;n timpul r&#259;zboiului de independen&#355;&#259;, de la turci. &#238;n timp ce Ferdinand a preferat s&#259; foloseasc&#259; coroana unchiului s&#259;u, pentru Maria a fost comandat&#259; o coroan&#259; special&#259; la o cas&#259; de bijuterii celebr&#259;, din Paris, iar aurul a fost donat de un proprietar de min&#259; din mun&#355;ii Apuseni, mai exact  1,8 kg. Pe c&#226;t de special&#259; &#351;i de valoroas&#259; pe at&#226;t este de plin&#259; de simboluri. Pe pandantivele laterale ale coroanei sunt inscrip&#355;ionare simboluri, mai exact &#238;n partea dreapt&#259; simbolul heraldic al Rom&#226;niei  iar &#238;n partea st&#226;ng&#259; simbolul heraldic al casei ei din Borough. De men&#355;ionat este faptul c&#259; regina Maria era nepoata Reginei Victoria a Marii Britanii &#351;i a &#355;arului Alexandru al II-lea. De asemenea, pentru ceremonia de &#238;ncoronare au fost comandate dou&#259; mantii, cea a regelui fiind f&#259;cut&#259; &#238;n str&#259;in&#259;tate iar cea a reginei a fost f&#259;cut&#259; &#238;n &#355;ar&#259;.



</p>

</div>
<div class="mine-third" ><br>
<a href="img/regele-ferdinand-regina-maria.jpg" target=blank> <img src="img/regele-ferdinand-regina-maria.jpg" style="float:right;"   width="80%">
</a>
</div>

</div>
 



<!-- Footer -->
<footer class="mine-container mine-padding-32 mine-theme-d1 mine-center" >

  <p> &copy;<i>Istorie &#351;i societate &#238;n dimensiune virtuala.</i></p>

  <div style="position:relative;bottom:100px;z-index:1;" class="mine-tooltip mine-right">
    <span class="mine-text mine-padding mine-teal mine-hide-small" style="height:60px;">Inapoi<br> Sus</span>   
    <a class="mine-btn mine-theme" href="#inceput"><span class="mine-xlarge">
    <i class="fa fa-chevron-circle-up"></i></span></a>
  </div>
</footer>

<!-- Script pt navigare laterala -->
<script>
function w3_open() {
    var x = document.getElementById("mySidenav");
    x.style.width = "300px";
    x.style.textAlign = "center";
    x.style.fontSize = "20px";
    x.style.paddingTop = "10%";
    x.style.display = "block";
}
function w3_close() {
    document.getElementById("mySidenav").style.display = "none";
}

// Folosit pt  meniu on pe ecranele mai mici cand se apasa pe butonul de meniu
function openNav() {
    var x = document.getElementById("navDemo");
    if (x.className.indexOf("mine-show") == -1) {
        x.className += " mine-show";
    } else { 
        x.className = x.className.replace(" mine-show", "");
    }
}
</script>

</body>
</html>